; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-6nodes-1000size-5degree-100mindistance-2trucks-4packages-732seed

(define (problem transport-three-cities-sequential-6nodes-1000size-5degree-100mindistance-2trucks-4packages-732seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-3-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 877,395 -> 678,123
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 34)
  ; 678,123 -> 877,395
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 34)
  ; 664,655 -> 678,123
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 54)
  ; 678,123 -> 664,655
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 54)
  ; 664,655 -> 877,395
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 34)
  ; 877,395 -> 664,655
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 34)
  ; 648,889 -> 877,395
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 55)
  ; 877,395 -> 648,889
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 55)
  ; 648,889 -> 664,655
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 24)
  ; 664,655 -> 648,889
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 24)
  ; 255,74 -> 678,123
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 43)
  ; 678,123 -> 255,74
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 43)
  ; 950,742 -> 877,395
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 36)
  ; 877,395 -> 950,742
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 36)
  ; 950,742 -> 664,655
  (road city-1-loc-6 city-1-loc-3)
  (= (road-length city-1-loc-6 city-1-loc-3) 30)
  ; 664,655 -> 950,742
  (road city-1-loc-3 city-1-loc-6)
  (= (road-length city-1-loc-3 city-1-loc-6) 30)
  ; 950,742 -> 648,889
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 34)
  ; 648,889 -> 950,742
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 34)
  ; 2414,147 -> 2096,539
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 51)
  ; 2096,539 -> 2414,147
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 51)
  ; 2092,176 -> 2096,539
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 37)
  ; 2096,539 -> 2092,176
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 37)
  ; 2092,176 -> 2414,147
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 33)
  ; 2414,147 -> 2092,176
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 33)
  ; 2666,363 -> 2096,539
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 60)
  ; 2096,539 -> 2666,363
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 60)
  ; 2666,363 -> 2414,147
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 34)
  ; 2414,147 -> 2666,363
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 34)
  ; 2666,363 -> 2788,682
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 35)
  ; 2788,682 -> 2666,363
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 35)
  ; 2666,363 -> 2092,176
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 61)
  ; 2092,176 -> 2666,363
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 61)
  ; 2683,634 -> 2096,539
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 60)
  ; 2096,539 -> 2683,634
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 60)
  ; 2683,634 -> 2414,147
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 56)
  ; 2414,147 -> 2683,634
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 56)
  ; 2683,634 -> 2788,682
  (road city-2-loc-6 city-2-loc-3)
  (= (road-length city-2-loc-6 city-2-loc-3) 12)
  ; 2788,682 -> 2683,634
  (road city-2-loc-3 city-2-loc-6)
  (= (road-length city-2-loc-3 city-2-loc-6) 12)
  ; 2683,634 -> 2666,363
  (road city-2-loc-6 city-2-loc-5)
  (= (road-length city-2-loc-6 city-2-loc-5) 28)
  ; 2666,363 -> 2683,634
  (road city-2-loc-5 city-2-loc-6)
  (= (road-length city-2-loc-5 city-2-loc-6) 28)
  ; 1461,2165 -> 1190,2381
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 35)
  ; 1190,2381 -> 1461,2165
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 35)
  ; 1003,2928 -> 1190,2381
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 58)
  ; 1190,2381 -> 1003,2928
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 58)
  ; 1960,2494 -> 1461,2165
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 60)
  ; 1461,2165 -> 1960,2494
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 60)
  ; 1023,2171 -> 1190,2381
  (road city-3-loc-5 city-3-loc-1)
  (= (road-length city-3-loc-5 city-3-loc-1) 27)
  ; 1190,2381 -> 1023,2171
  (road city-3-loc-1 city-3-loc-5)
  (= (road-length city-3-loc-1 city-3-loc-5) 27)
  ; 1023,2171 -> 1461,2165
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 44)
  ; 1461,2165 -> 1023,2171
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 44)
  ; 1707,2360 -> 1190,2381
  (road city-3-loc-6 city-3-loc-1)
  (= (road-length city-3-loc-6 city-3-loc-1) 52)
  ; 1190,2381 -> 1707,2360
  (road city-3-loc-1 city-3-loc-6)
  (= (road-length city-3-loc-1 city-3-loc-6) 52)
  ; 1707,2360 -> 1461,2165
  (road city-3-loc-6 city-3-loc-2)
  (= (road-length city-3-loc-6 city-3-loc-2) 32)
  ; 1461,2165 -> 1707,2360
  (road city-3-loc-2 city-3-loc-6)
  (= (road-length city-3-loc-2 city-3-loc-6) 32)
  ; 1707,2360 -> 1960,2494
  (road city-3-loc-6 city-3-loc-4)
  (= (road-length city-3-loc-6 city-3-loc-4) 29)
  ; 1960,2494 -> 1707,2360
  (road city-3-loc-4 city-3-loc-6)
  (= (road-length city-3-loc-4 city-3-loc-6) 29)
  ; 950,742 <-> 2096,539
  (road city-1-loc-6 city-2-loc-1)
  (= (road-length city-1-loc-6 city-2-loc-1) 117)
  (road city-2-loc-1 city-1-loc-6)
  (= (road-length city-2-loc-1 city-1-loc-6) 117)
  (road city-1-loc-6 city-3-loc-4)
  (= (road-length city-1-loc-6 city-3-loc-4) 128)
  (road city-3-loc-4 city-1-loc-6)
  (= (road-length city-3-loc-4 city-1-loc-6) 128)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 148)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 148)
  (at package-1 city-3-loc-3)
  (at package-2 city-2-loc-3)
  (at package-3 city-1-loc-4)
  (at package-4 city-1-loc-4)
  (at truck-1 city-2-loc-5)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-4)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-1-loc-4)
  (at package-2 city-1-loc-4)
  (at package-3 city-3-loc-4)
  (at package-4 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 4
2. (pick-up truck-1 city-2-loc-3 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-2-loc-3) (capacity truck-1 capacity-4)
   added: (in package-2 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 4
3. (drive truck-1 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 4
4. (drive truck-1 city-2-loc-5 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 4
5. (drive truck-1 city-2-loc-1 city-3-loc-1)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 4
6. (drive truck-1 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-3)
   goals met: 0 of 4
7. (pick-up truck-1 city-3-loc-3 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-3-loc-3) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 4
8. (drive truck-1 city-3-loc-3 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-3)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 4
9. (drive truck-1 city-3-loc-1 city-2-loc-1)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 4
10. (drive truck-1 city-2-loc-1 city-1-loc-6)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-1-loc-6)
   goals met: 0 of 4
11. (drive truck-1 city-1-loc-6 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-6)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 4
12. (pick-up truck-1 city-1-loc-4 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-4) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 4
13. (pick-up truck-1 city-1-loc-4 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-4) (capacity truck-1 capacity-1)
   added: (in package-3 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 4
14. (drop truck-1 city-1-loc-4 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-1-loc-4) (capacity truck-1 capacity-1)
   goals met: 1 of 4
15. (drop truck-1 city-1-loc-4 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-1-loc-4) (capacity truck-1 capacity-2)
   goals met: 2 of 4
16. (drive truck-1 city-1-loc-4 city-1-loc-6)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-6)
   goals met: 2 of 4
17. (drive truck-1 city-1-loc-6 city-3-loc-4)
   deleted: (at truck-1 city-1-loc-6)
   added: (at truck-1 city-3-loc-4)
   goals met: 2 of 4
18. (drop truck-1 city-3-loc-4 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-3-loc-4) (capacity truck-1 capacity-3)
   goals met: 3 of 4
19. (drive truck-1 city-3-loc-4 city-1-loc-6)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-1-loc-6)
   goals met: 3 of 4
20. (drive truck-1 city-1-loc-6 city-2-loc-1)
   deleted: (at truck-1 city-1-loc-6)
   added: (at truck-1 city-2-loc-1)
   goals met: 3 of 4
21. (drive truck-1 city-2-loc-1 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-5)
   goals met: 3 of 4
22. (drive truck-1 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-3)
   goals met: 3 of 4
23. (drop truck-1 city-2-loc-3 package-4 capacity-3 capacity-4)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-3)
   added: (at package-4 city-2-loc-3) (capacity truck-1 capacity-4)
   goals met: 4 of 4
